{
  "meta": {
    "theme": "stackoverflow"
  },
  "basics": {
    "name": "Daniel Teycheney",
    "label": "Automation Professional",
    "image": "https://github.com/writememe/public-resume/blob/main/images/daniel_teycheney.jpg?raw=true",
    "email": "danielfjteycheney@gmail.com",
    "url": "https://blog.danielteycheney.com",
    "summary": "I enjoy designing and building solutions, automating processes and working on team projects which make a real difference to a customers IT experience.\nPut simply, I like to leave all teams, organisations and environments in a better position than when I found them.",
    "location": {
      "postalCode": "3226",
      "city": "Ocean Grove",
      "countryCode": "AU",
      "region": "Victoria"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "writememe",
        "url": "https://github.com/writememe"
      },
      {
        "network": "LinkedIn",
        "username": "Daniel Teycheney",
        "url": "https://www.linkedin.com/in/danielfjteycheney/"
      },
      {
        "network": "Twitter",
        "username": "danielteycheney",
        "url": "https://twitter.com/danielteycheney"
      }
    ]
  },
  "work": [
    {
      "name": "Atlassian",
      "position": "Cloud Network Engineer",
      "url": "https://www.atlassian.com/",
      "startDate": "2024-07-29",
      "description": "Atlassian is an Australian-American software company that develops products for software developers, and project managers among other groups.",
      "summary": "Working as part of the Edge Services team which are responsible for building and operating a secure, scalable, and reliable public Edge layer that terminates public client connections, applies business-wide compliance and security measures, and load-balance traffic internally",
      "highlights": [
        "Built custom health check APIs and automated post-deployment validation using pytest and synthetic monitoring, eliminating manual deployment shepherding for critical services",
        "Containerised Squid proxy service and decoupled compilation from AMI builds, reducing build times by 5 minutes per build and enabling flexible deployment options across environments",
        "Designed comprehensive SignalFX monitoring with custom Python collectors and environment-aware filtering for load balancing platform, decreasing detection time and uplift troubleshooting capabilities for future incidents",
        "Consolidated and modernised 70 repositories, migrating active repositories to cloud platforms and archiving legacy codebases to enable enterprise compliance",
        "Migrated logging pipeline from Vector to Fluent Bit, reducing tooling complexity and improving observability across multiple services",
        "Achieved 192GB monthly storage savings by optimising logging volume on security-compliant proxies, reducing operational costs and addressing quota requirements",
        "Mentoring multiple new team members and contributed to strategic planning, accelerating team onboarding and improving development practices across the team"
      ]
    },
    {
      "name": "Dragonfly Technologies",
      "position": "Senior Automation Engineer",
      "url": "https://www.dragonflytechnologies.com/",
      "startDate": "2022-06-20",
      "endDate": "2024-07-24",
      "description": "Dragonfly Technologies is a systems integrator which provides cyber security, network and automated managed services to customers in Australia.",
      "summary": "Working as part of the development team, supporting an internally developed microservices platform by performing a variety of tasks",
      "highlights": [
        "Rebuilt AWS environment using Pulumi and Python via Github Actions",
        "Migration of approx 35 repositories from Bitbucket to Github",
        "Created pipelines that automated build of microservice containers into AWS ECR and automate the release notes into Github",
        "Created pipelines that deployed Kubernetes manifests into AWS EKS using Kustomize",
        "Remediated and optimised automated Python test pipelines for each release, reducing pipeline runs from 45 minutes down to 3 minutes",
        "Implemented and automated code quality standards across all Python-based repositories",
        "Integrated automated Github actions pipeline notifications via Slack",
        "Developed reusable automation solutions in Python, which are used across various customers"
      ]
    },
    {
      "name": "Transurban",
      "position": "Network Automation Engineer",
      "url": "https://www.transurban.com/",
      "startDate": "2020-08-01",
      "endDate": "2022-06-17",
      "description": "Transurban is a road operator company that manages and develops urban toll road networks in Australia, Canada and the United States.",
      "summary": "Defining, leading and implementing network automation solutions for the corporate and roadside network teams, using a Python-centric approach.",
      "highlights": [
        "Development of network automation roadmap to progress network automation efforts within the organisation",
        "Lead developer for network automation architectural and design decisions",
        "Establishment of Source of Truth solution to identify and mass remediate inventory data inside ServiceNow",
        "Development of daily automated backup solution, including secret masking (approx 1050 devices)",
        "Development of automated compliance solutions (approx 24,000 checks over 1400 devices)",
        "Development of standards for code development, installation instructions to ensure code portability and ease of use across various platforms",
        "Code refactor of all existing code projects to ensure that projects are consistent and follow best practices, such as adherence to style guides and readability",
        "Mentoring of other staff on improving programming skills, including running internal sessions on topics such as FastAPI, nornir and code quality practices"
      ]
    },
    {
      "name": "Australian Super",
      "position": "Cloud Engineer (Contract)",
      "url": "https://www.australiansuper.com/",
      "startDate": "2019-12-01",
      "endDate": "2020-06-30",
      "description": "AustralianSuper is the largest Australian superannuation and pension fund, with roughly 1 in 10 Australian workers as members.",
      "summary": "Assisting the cloud team in maturing the cloud offering, with a focus on networking automation within the multi-region cloud environment.",
      "highlights": [
        "Development of Ansible playbooks for Checkpoint firewall rule automation",
        "Mentoring of other staff on improving network automation skills, including running internal sessions on topics such as Ansible",
        "Deployment of internal Terraform module for Checkpoint high availability (HA) deployments in Azure",
        "Remediating Azure DevOps pipelines to ensure that builds are consistently deployed across regions"
      ]
    },
    {
      "name": "Basis Networks",
      "position": "Managing Consultant",
      "url": "https://cybercx.com.au/about-cybercx/basis/",
      "startDate": "2019-07-01",
      "endDate": "2019-11-30",
      "description": "Basis Networks is a leading provider of network and security solutions for some of Australia’s ASX 200 companies.",
      "summary": "Implemented a network automation strategy for company wide code projects, with Python being the primary programming language",
      "highlights": [
        "Consolidation of disparate code locations into a central code repository (Bitbucket)",
        "Code refactor of all existing code projects to ensure that projects are consistent and follow best practices, such as adherence to style guides and readability",
        "Development of standards for code development, installation instructions to ensure code portability and ease of use across various platforms",
        "Mentoring of other staff on improving programming skills, including running internal sessions on topics such as Ansible"
      ]
    },
    {
      "name": "Basis Networks",
      "position": "Senior Consultant",
      "url": "https://cybercx.com.au/about-cybercx/basis/",
      "startDate": "2016-02-01",
      "endDate": "2019-06-30",
      "description": "Basis Networks is a leading provider of network and security solutions for some of Australia’s ASX 200 companies.",
      "summary": "Lead a number of large scale network and security projects for large Australian enterprise businesses, using automation",
      "highlights": [
        "Designed and implemented a decoupling of management networks from the production network on behalf of Australia’s largest postal service, to mitigate a significant business risk of loss of management access during a critical network outage at either of their data centres.",
        "Performed a second data centre relocation and consolidation for a subsidiary on behalf of Australia’s largest postal service, in order to retire legacy infrastructure and recoup significant data centre hosting savings for the business. ",
        "Performed a firewall rule remediation for a large inbound information management service company, removing several thousand rules over  seven high availability firewall pairs.",
        "Performed a data centre relocation and consolidation for a subsidiary on behalf of Australia’s largest postal service, in order to retire legacy infrastructure and recoup significant data centre savings for the business.",
        "Developed a Python application to provide a configuration backup tool for Basis Networks’ managed service offering to diversify the company’s offerings."
      ]
    },
    {
      "name": "Telstra Corporation",
      "position": "Technical Consultant",
      "url": "https://www.telstra.com.au/",
      "startDate": "2015-06-01",
      "endDate": "2016-01-31",
      "description": "Telstra Corporation is an Australian telecommunications company that builds and operates telecommunications networks and markets related products and services",
      "summary": "As part of a team of four consultants, designed and built two new data centre networks for a large gambling company.",
      "highlights": [
        "Designing and implementation for one of Australia’s first Cisco ACI implementations",
        "Designing a multi VRF routing solution for new network",
        "Develop change plans and cutovers to the new network"
      ]
    },
    {
      "name": "O2 Networks",
      "position": "Technical Consultant",
      "startDate": "2014-06-01",
      "endDate": "2015-05-31",
      "description": "Transitioned over to Telstra as part of their acquisition of O2 Networks.",
      "summary": "Lead a WAN migration for over eighty sites across Australia for a large health organisation from one WAN service provider to another.",
      "highlights": [
        "Liaised with various stakeholders involved in WAN migration activities",
        "Designed and compiled network changes for implementation at all sites",
        "Develop test cases and test plans to ensure successful WAN migrations",
        "Developed standard change procedures and plans for migrations",
        "Organising network resourcing and schedule for all migrations"
      ]
    },
    {
      "name": "Treasury Wine Estates",
      "position": "Network Engineer",
      "url": "https://www.tweglobal.com/",
      "startDate": "2012-11-01",
      "endDate": "2014-05-31",
      "description": "Transitioned over to Telstra as part of their acquisition of O2 Networks.",
      "summary": "Treasury Wine Estates (TWE) is one of the world’s largest wine companies, with a global winemaking and distribution business operating in multiple countries.",
      "highlights": [
        "Worked in a global network services team which is responsible for over ninety sites globally, primary lead for the Australia and Asia Pacific, approximately 60 sites",
        "Involved in gathering network requirements, interpreting into network designs, implementations (onsite and remote) and support/BAU",
        "Designing, configuring and implementing site integrations into TWE internal network",
        "Developing standards for monitoring, routing and switching practices globally",
        "Installing, configuring and management of Cisco routing, switching, wireless, WAN optimisation and firewalls",
        "Operational changes and management of Nexus switching, F5 load balancing, McAfee Web Gateways"
      ]
    },
    {
      "name": "Travelling",
      "position": "Traveller",
      "startDate": "2012-06-01",
      "endDate": "2012-10-31",
      "summary": "Travelling through Europe on a career break.",
      "highlights": []
    },
    {
      "name": "ISN Solutions Ltd",
      "position": "Network Engineer",
      "url": "https://www.isnsolutions.co.uk/",
      "startDate": "2010-11-01",
      "endDate": "2012-05-31",
      "description": "ISN Solutions Ltd was a leader in  providing IT solutions, primarily to the Oil and Gas Industry.",
      "summary": "Part of the network team performing network services for ISN Solutions' managed service customers.",
      "highlights": [
        "Installing, configuring and management of Cisco routers, switches, firewalls and wireless access points",
        "Installing, configuring and management of Cisco Unified Call Manager Express (CME) and Cisco Unified Communications Small Business Systems (UC540 and UC 560 series)",
        "Installing, configuring and management of Riverbed Steelhead WAN optimisers",
        "Installing, configuring and management of Websense Web Security software",
        "Co-ordinated and relocated customers from onsite services to hosting centre migrations",
        "Configuration and management of Checkpoint UTM and open server firewalls",
        "Coordinating and liaising with third party vendors such as Internet Service Providers to install, configure and troubleshoot components of customer networks.",
        "Mentoring and training new network engineers as part of team expansion",
        "Remote monitoring, reporting and management of networking suite using N-Central monitoring system",
        "Configuring and implementing complete network solution for deployment on oil rig"
      ]
    },
    {
      "name": "Deakin University",
      "position": "Network Engineer",
      "url": "https://www.deakin.edu.au",
      "startDate": "2008-05-01",
      "endDate": "2010-10-31",
      "description": "Deakin University is one of Australia’s leading universities, with a focus on using IT to enhance the students’ experience.",
      "summary": "Principal contact for all onsite Networking faults, service requests and queries at Deakin University, Waurn Ponds campus and ensuring their completion in line with Service Level Agreements",
      "highlights": [
        "Installing, configuring and load testing UPS Devices",
        "Installing, troubleshooting and configuration of Tandberg Video Conferencing systems",
        "Installing, configuring and replacing Cisco switches, wireless access points and routers for the University network as per customer requirements",
        "Complete requests for configuration of Cisco IP Phones and IP Voice Points using Cisco Call Manager 4.3 and 7",
        "Coordinate and organise Change Records and Outage Notifications to alert customers of IT Service disruptions in line with ITIL best-practice.",
        "Coordinate with Systems Administrators to complete all networking requests for servers in the Universities data centre",
        "Liaise with Facilities Management for design, fit-out and installation of network services into new and refurbished building projects",
        "Coordinate contractors to complete data outlet cabling, system tails for switches and server hosts",
        "Complete cabling requests for fax lines, auto-diallers and EFTPOS lines by cabling from MDF to end-customer locations"
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "endDate": "2006-01-01",
      "startDate": "2004-02-01",
      "area": "Information Technology (Network Engineering)",
      "studyType": "Diploma",
      "institution": "Computer Power Institute of Technology"
    },
    {
      "endDate": "2019-05-01",
      "startDate": "2019-02-01",
      "area": "Building Network Automation Solutions",
      "studyType": "Online Course",
      "institution": "IP Space",
      "url": "https://my.ipspace.net/bin/list?id=NetAutSol"
    }
  ],
  "awards": [],
  "certificates": [
    {
      "name": "Cisco Certified DevNet Associate",
      "date": "2021-03-31",
      "issuer": "Cisco Systems",
      "url": "https://www.credly.com/badges/0a73a568-0b41-4683-8048-45d2bd7f0e9b"
    },
    {
      "name": "AWS Certified Solutions Architect - Associate",
      "date": "2019-11-28",
      "issuer": "Amazon Web Services",
      "url": "https://www.credly.com/badges/5da1818a-0512-4bd0-a80e-400c055be984"
    },
    {
      "name": "Cisco Certified Network Professional Enterprise (CCNP Enterprise)",
      "date": "2014-05-24",
      "issuer": "Cisco Systems",
      "url": "https://www.credly.com/badges/8d657700-161a-4051-bc39-b5993f103ead"
    },
    {
      "name": "Cisco Certified Design Professional (CCDP)",
      "date": "2015-05-22",
      "issuer": "Cisco Systems",
      "url": "https://www.credly.com/badges/56deb085-62fb-4082-bd12-047641226f7b"
    }
  ],
  "publications": [
    {
      "name": "The Art of Network Engineering Podcast",
      "publisher": "The Art of Network Engineering",
      "releaseDate": "2020-12-01",
      "url": "https://artofnetworkengineering.com/2020/12/09/ep-21-he-automates-a-lan-down-unda/",
      "summary": "Appeared on the podcast and spoke about network automation and my journey to becoming a network automation engineer"
    },
    {
      "name": "Heavy Networking 554: Mistaking Commercial Software For A Security Blanket",
      "publisher": "Packet Pushers",
      "releaseDate": "2020-12-11",
      "url": "https://packetpushers.net/podcasts/heavy-networking/hn554-mistaking-commercial-software-for-a-security-blanket/",
      "summary": "Appeared on the podcast and spoke about open source versus commercial software and some of the key considerations"
    },
    {
      "name": "The Hedge 73: Daniel Teycheney and Open Source in Networking",
      "publisher": "The Hedge",
      "releaseDate": "2021-03-05",
      "url": "https://rule11.tech/the-hedge-73-daniel-teycheney-and-open-source-in-networking/",
      "summary": "Appeared on the podcast and spoke about open source software as it relates to networking and network automation"
    },
    {
      "name": "E127 - Daniel Teycheney at Dragonfly Technologies",
      "publisher": "Hamilton Barnes",
      "releaseDate": "2023-06-22",
      "url": "https://www.hamilton-barnes.com/resources/podcast/e127---daniel-teycheney-at-dragonfly-technologies/",
      "summary": "Appeared on the podcast and about my background, approach and mindset to one's career."
    },
    {
      "name": "The Hedge 216: Automation Success Stories",
      "publisher": "The Hedge",
      "releaseDate": "2024-03-08",
      "url": "https://rule11.tech/hedge-216/",
      "summary": "Appeared on the podcast to discuss the issues around adopting automation within an organisation."
    }
  ],
  "skills": [
    {
      "name": "Network Automation",
      "level": "Advanced",
      "keywords": [
        "Nornir",
        "NAPALM",
        "Scrapli",
        "Netmiko",
        "jmespath",
        "Pandas",
        "Jinja2",
        "Ansible",
        "Data modelling"
      ]
    },
    {
      "name": "Observability",
      "level": "Intermediate",
      "keywords": [
        "Splunk",
        "SignalFx",
        "Fluent Bit"
      ]
    },
    {
      "name": "Consulting",
      "level": "Advanced",
      "keywords": [
        "Migration Strategies",
        "Architecture and Roadmaps",
        "High Level Designs / Detailed Designs",
        "Network Assessments / Network Remediation"
      ]
    },
    {
      "name": "Programming",
      "level": "Intermediate",
      "keywords": [
        "Python",
        "Terraform",
        "FastAPI",
        "Pulumi",
        "JSON",
        "YAML"
      ]
    },
    {
      "name": "GitOps",
      "level": "Intermediate",
      "keywords": [
        "Bitbucket",
        "Bitbucket Pipelines",
        "TravisCI",
        "Azure DevOps",
        "Github",
        "Github Actions",
        "Infrastructure as Code",
        "Bamboo"
      ]
    },
    {
      "name": "Amazon Web Services (AWS)",
      "level": "Intermediate",
      "keywords": [
        "VPCs",
        "Transit Gateways",
        "NAT Gateways",
        "Subnets",
        "Route Tables",
        "Security Groups",
        "EKS",
        "ECR",
        "EC2",
        "Lambda",
        "IAM",
        "CloudFormation"
      ]
    },
    {
      "name": "Microsoft Azure",
      "level": "Intermediate",
      "keywords": [
        "Load Balancing",
        "VNETs",
        "Network Security Groups"
      ]
    },
    {
      "name": "Networking",
      "level": "Advanced",
      "keywords": [
        "BGP",
        "OSPF",
        "EIGRP",
        "VRF Route Leaking",
        "vPC",
        "VXLAN",
        "FabricPath",
        "STP",
        "Load Balancing",
        "WAN Optimisation",
        "Wireless",
        "Next-Generation Firewalls",
        "Vulnerability Scanning",
        "Virtual Private Networks"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Cycling",
      "keywords": [
        "Bikepacking",
        "Outdoor Adventuring"
      ]
    }
  ],
  "references": [],
  "projects": [
    {
      "name": "motherstarter",
      "startDate": "2020-11-09",
      "description": "A network data transformation tool to accelerate the adoption of network automation by providing a command-line interface to convert input file sources to various network automation output formats.",
      "highlights": [
        "Maintainer of the project"
      ],
      "url": "https://github.com/writememe/motherstarter"
    },
    {
      "name": "Building Network Automation Solutions - Course Assignments",
      "startDate": "2019-02-01",
      "endDate": "2019-05-01",
      "description": "As part of completing the course, my portfolio of coursework can be found on Github",
      "url": "https://github.com/writememe/BlgNetAutoSol"
    }
  ]
}